
/*
 * 泛型生命周期注解基础语法
 */

// 泛型生命周期注解示语法
//使用<'a> 表示生命周期a , 使用['a 变量]给变量添加生命周期注解
//什么时候需求生命周期注解：编译器无法确定引用的生命周期时
//例如示例代码中的，形参x和y以及返回值都是切片的引用类型，编译器无法确定x和y的生命周期是否相同，
//所以需要添加生命周期注解，告诉编译器x和y的生命周期是相同的，并且返回值的生命周期也是x和y的生命周期的
//一般的，如果返回值依赖于形参的生命周期，需要添加生命周期注解，只需要给依赖于形参的生命周期的变量和返回值添加生命周期注解即可
fn print_longest<'a>(x: &'a str, y: &'a str) -> &'a str{
    if x.len() > y.len() {
        x
    } else {
        y
    }
}

pub fn demo(){
    println!("...............泛型生命周期注解示例开始...................");
    let s1 = String::from("hello");
    let s2 = String::from("world");
    let result = print_longest(&s1, &s2);
    println!("{}", result);
    println!("...............泛型生命周期注解示例结束...................");
}
